package com.wai.domain.enneagramExplain;

import org.junit.jupiter.api.BeforeEach;
import org.junit.jupiter.api.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

import static org.junit.jupiter.api.Assertions.*;

/**
 * packageName : com.wai.domain.enneagramExplain
 * fileName : EnneagramExplainRepositoryTest
 * author : 윤신영
 * date : 2022-01-28
 * description :
 * ===========================================================
 * DATE      AUTHOR      NOTE
 * -----------------------------------------------------------
 * 2022-01-28   윤신영     최초 생성
 */
@RunWith(SpringRunner.class)
@SpringBootTest
class EnneagramExplainRepositoryTest {

    @Autowired
    private EnneagramExplainRepository enneagramExplainRepository;

    @BeforeEach
    void beforeEach() {
        enneagramExplainRepository.deleteAll();
    }

    @Test
    void insertData() {
        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(1)
                .basicExplains("1번유형들은 그것이 얼마만큼인지 자신이 미칠 수 있는 영향력을 사용하여 세상을 개선시키고자 하는 사명감을 갖고 있다. 이들은" +
                        " 역경을 극복하려고 노력한다. 역경의 극복을 통해서 인간의 정신은 빛날 수 있다. 이들은 큰 희생을 치르고라도 높은 이상을" +
                        " 실현시키기 위해 노력한다.|" +
                        " 역사 속에는 더 높은 이상이 자신을 부르기 때문에 위대한 일을 위해 안락한 삶을 버린 인물들이 많다. 2차 세계 대전 동안 라울 발렌버그는 " +
                        "유럽에 살고 있떤 수천명의 유대인을 나치로부터 구하기 위하여 안락한 중산층의 삶을 버렸다. 간디는 인도의 독립과 비폭력 사회 운동을 위하여 아내와" +
                        " 가족, 성공적인 변호사 생활을 버렸다.|" +
                        "1번 유형들은 실질적인 행동을 하는 사람들이다. 이들은 유용한 사람이 되기를 원한다. 이들은 자신의 삶에서 '이루어야 할 사명'이 있다고 느낀다." +
                        " 1번 유형들은 강한 목적의식을 갖고 있으며, 자신과 타인에게 자신의 행동을 정당화해야 한다고 느낀다. 이러한 경향 때문에 1번 유형들은 자신의 행동이" +
                        " 가져올 결과에 대해 많이 생각한다. 또 어떻게 하면 자신의 신념에 어긋나는 행동을 하지 않을지 고심한다." +
                        " 그래서 1번 유형들은 자신이 '머리형', 즉 논리와 객관적인 사실이 앞서야만 행동할 수 있는 이성적인 사람이라고 생각하기 쉽다. 그러나 이것과는 사실과 다르다." +
                        " 1번 유형들은 자신이 해야 한다고 느끼는 것에 대해서 받아들일 수 있는 이성적 근거를 찾으려고 애쓰는, 적극적으로 행동하는 사람들이다. " +
                        "이들은 확신과 판단을 통해서 자기 행동을 통제하고 지시하는, 본능과 열정의 사람들이다.|" +
                        " 1번 유형들은 자신의 원칙을 고수하려고 노력하는 과정에서 자신의 본능적인 충동에 영향을 받는 것에 저항한다. 이들은 본능적인 충동에 자신을" +
                        " 내맡기거나 쉽게 그것을 드러내지 않는다. 그래서 억압, 저항, 공격과 연관된 성격이 형성된다. 다른 사람들은 이들이 스스로를 잘 통제하고 경" +
                        "직되어 있는 사람으로 여기지만 자신은 그렇게 생각하지 않는다.|" +
                        " 1번유형들은 자신에게 철저한 것(결국 완벽해지는것)이 스스로와 다른 사람에게 자신을 정당화할 수 있는 방법이라고 믿는다. 그러나 이들은" +
                        " 완벽해지기 위해서 스스로를 괴롭힌다.")
                .merits("자기 훈련이 잘 되어 있으며 큰일을 해낼 능력이 있다.|세상을 더 나은 곳으로 만들기 위해 열심히 일한다.|" +
                        "높은 기준과 윤리의식을 가지고 있기 때문에 자신과 타협하지 않는다.|" +
                        "합리적이고 책임감이 강하며 헌신적이다.|" +
                        "통합적인 사고를 하고 이해력이 좋으며 지혜로운 해결책을 제시한다.|" +
                        "자신과 사람들에게서 최상의 모습을 이끌어 내려 한다.")
                .demerits("기대에 못 미칠 때 자신과 사람들에게 실망한다.|" +
                        "지나친 책임감으로 인해 부담을 느낀다.|" +
                        "충분히 잘 하고 있다고 생각한 적이 한번도 없다.|" +
                        "사람들이 내가 그들을 위해 한 일에 대해 고마워하지 않으면 화가 난다.|" +
                        "사람들이 나만큼 열심히 일하지 않는것 같아 속상하다.|" +
                        "이미 한 일이나 해야 할 일에 대한 강박관념이 심하다.|" +
                        "신경이 날카롭고 걱정이 많으며 매사에 지나치게 심각하다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("temp")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(2)
                .basicExplains("이 유형의 사람들은 다른 사람에게 정말로 도움이 많이 된다. 이들은 힘든 상태에 있을 때 자신이 도움을 주는 사람으로" +
                        " 여겨지도록 하는데 많은 관심을 쏟는다. 2번 유형은 다른사람을 너그럽게 대하고 사람들을 위해서 뭔가를 할 때 삶을 가장 의미있고" +
                        " 풍요롭게 느낀다. 사람들에 대한 이들의 사랑과 관심 그리고 친절은, 이들 자신의 가슴을 따뜻하게하고 가치 있는 사람이라고 느끼게 해준다." +
                        " 2번 유형은 사랑, 친밀함, 가족, 우정과 같이 삶에서 정말로 기분 좋게 느껴지는 것들에 많은 관심을 쏟는다.|" +
                        " 루이스는 2번 유형으로 자신이 느끼는 기쁨을 이렇게 말한다. '나는 사람들과 교류를 하면서 사는게 좋아요. 사람들에 대해 사랑을 갖고" +
                        " 돌봐 줄 때 저는 정말 좋은 기분을 느끼게 되지요. 나는 다른 사람이 자기 이야기를 할 때 잘 이해하고 들어줄 수 있어요. 나는 남들과 잘 지" +
                        "낼수 있는것이 기뻐요. 또 사람, 동물, 물건을 정말로 사랑할 줄 알지요.'|" +
                        "2번유형은 건강하고 균형 잡혀 있는 상태일 때 사랑이 많고, 남에게 도움을 주며, 관대하고, 사려 깊다. 벌이 꿀에 끌리듯이 사람들은 이 " +
                        "유형에게 끌린다. 자신의 가슴에서 나오는 온기로 다른 사람들을 따뜻하게 해준다. 이들은 애정과 관심으로 다른 사람들의 삶에 생기를 불어넣고" +
                        " 사람들이 전에는 인식하지 못했던 자신의 좋은 점들을 볼 수 있도록 해준다.|" +
                        " 이들은 사람들을 있는 그대로 보아주고 큰 사랑으로 이해하며 무한한 인냇미을 갖고 격려할 줄 안다. 또한 언제나 기꺼이 도움을 주려는 마음을" +
                        " 가지고 있으며 언제 어떻게 상대방을 놓아 주어야 하는지를 정확하게 알고 있다.|" +
                        " 그러나 2번 유형의 내면적 발전은 이들이 가지고 있는 어두운 면들에 의해 제약을 받는다. 그것은 자만심, 자기기만, 지나치게 다른 사람들의 삶에" +
                        " 개입하려는 경향, 자신의 감정적인 필요를 충족시키기 위해서 다른 사람들을 조종하려는 경향 등이다. 스스로를 개선시키려는 노력은 이들을" +
                        " 자신 안의 어두운 곳으로 끌고 들어간다. 그리고 이것은 긍정적인 면만을 보기를 원하는 2번의 성격 구조와는 상반되는 것이다.|" +
                        "2번 3번, 4번의 유형이 내면을 탐구하는 과정에서 만나는 가장 큰 장애는 자신이 가치없는 존재라는 내면의 두려움과 만나는 것이다. 이 세 유형들은" +
                        " 깊은 내면에 스스로가 가치 없는 존재라는 두려움을 가지고 있다. 그래서 다른 사람들로부터 사랑을 얻고 받아들여지기 위해서 이들은 어떤" +
                        " 존재가 되어야 하고 어떤 일을 해야 하는 것이다. 평균 상태에서 건강하지 않는 상태에 있는 2번 유형은 자신이 아주 너그러우며 이기심이 없고 " +
                        "스스로를 위해서는 어떤 보상도 원하지 않는 다는 잘못된 자기 이미지를 내세우지만 실제로 이들은 엄청난 기대와 인식되지 않은 감정적 필요를 가지고 있다.|")
                .merits("사람들과 쉽게 관계를 맺고 친구가 된다.|" +
                        "사람들의 필요를 알아 그들의 삶을 더 낫게 만든다.|" +
                        "관대하고 다른 사람들을 잘 보살피며 마음이 따뜻하다.|" +
                        "다른 사람의 감정을 민감하게 알아차린다.|" +
                        "열정적이고 재미있는 것을 좋아하며 유머 감각이 있다.")
                .demerits("'아니요'라고 말하는 것이 힘들다.|" +
                        "자존감이 낮다.|" +
                        "다른 사람들 위해 힘에 부치게 일하다가 지쳐버린다.|" +
                        "이기적이 될까 두려워서, 정작 자신이 하고 싶은 일을 못한다.|" +
                        "생각만큼 사랑하는 마음이 생기지 않는 자신을 자책한다.|" +
                        "상대방에게 관심을 기울이는 만큼 관심 받지 못할 때 속상하다.|" +
                        "다른 사람을 지나치게 배려하고 눈치를 보느라 진짜 자신의 감정은 억압한다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은 상태일 때 2유형은 너그럽고 따듯하며, 다른 사람을 배려하고 그들의 진가를 알아본다. 또한 쾌활하며 다른 사람들을 잘 보살피고, 상대방이 특별하고" +
                        " 사랑 받는 존재라고 느끼도록 해 준다.|" +
                        "힘들 상태일 때 2유형은 상대방을 통제하고 소유하려 들며 요구가 많고, 불편한 마음과는 다르게 말이나 행동을 하기도 한다. 또한 직접적으로 요구하는 것을 어려워하기 때문에" +
                        " 원하는 것을 얻기 위해 다른 사람을 조종하려는 경향이 있다.")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(3)
                .basicExplains("temp")
                .merits("낙천적이고 친근하며 명랑하다.|가족을 잘 부양한다.|실패를 빨리 극복하고 다음 과제를 향해 나아간다.|" +
                        "정보에 밝으며 상황이 어떻게 돌아가는지 잘 파악한다.|" +
                        "효율적이고 능숙하게 일을 처리한다.|" +
                        "사람들에게 동기부여를 잘한다.")
                .demerits("비효율적이거나 무능한 것을 참기 힘들다.|" +
                        "성공하지 못하거나 성공하지 못한 것처럼 보이는 것이 두렵다.|" +
                        "무엇이든 자신보다 더 잘하는 사람들과 비교한다.|" +
                        "성공에 집착하며 성공하기 위해 분투한다.|" +
                        "사람들에게 좋은 인상을 주기 위해 표면적으로 행동한다.|" +
                        "항상 무언가를 하고 있기 때문에 쉽게 지친다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은 상태일 때 3유형은 상대방을 가치 있게 여기고 수용적으로 대한다. 또한 쾌활하고 베풀기를 잘하며, 책임감 있고 공동체 안에서 호평을 받는다.|" +
                        "힘든 상태일 때 3유형은 일과 프로젝트에 얾매여 있으며 자기 일에만 몰두해 있다. 또한 방어적이며 참을성이 없고 정직하지 않으며 사람이나 상황을 통제하려 한다.")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(4)
                .basicExplains("temp")
                .merits("삶에서 의미를 발견하고 깊은 수준의 감정을 느낄 수 있다.|" +
                        "사람들과 따뜻한 관계를 맺는 능력이 있다.|" +
                        "삶에서 고결하고 진실하며 아름다운 것을 찬미한다.|" +
                        "창의성과 직관력이 있다.|" +
                        "독특하며, 다른 사람들의 눈에도 남달라 보인다.|" +
                        "심미적인 감각을 가지고 있다.|" +
                        "주변 사람들의 감정을 쉽게 알아차린다.")
                .demerits("공허함이나 절망 같은 우울한 기분을 경험한다.|" +
                        "자신을 사랑받을 만한 자격이 없는 존재로 여기고 미워하며 부끄러워한다.|" +
                        "사람들을 실망시켰을 때 죄책감을 느낀다.|" +
                        "누군가 나를 오해하면 상처받거나 공격받았다고 느낀다.|" +
                        "자신과 인생에 대한 기대치가 매우 높다.|" +
                        "버림받을까봐 두려워한다.|" +
                        "분한 마음에 사로잡혀 있다.|" +
                        "갖고 있지 않은 것을 갈망한다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("temp")
                .surroundingEvaluations("좋은 상태일 때 4유형은 온화하며 공감을 잘하고 사람들을 지지해 준다. 또한 쾌활하고 열정적이며 재치가 있고. 자신의 감정을 잘 표현하며 다른 사람과 쉽게 관계를 맺는다.|" +
                        "힘든 상태일 때 4유형은 지나치게 자기 안에 매몰되는 경향이 있고 질투를 하며 정서적으로 메말랐다고 느낀다. 그들을 감정 기복이 심하고" +
                        " 독선적이며 지나치게 비판적이기도 하다. 또한 쉽게 상처받으며 다른 사람들에게 거절당했다고 느낀다.")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(5)
                .basicExplains("temp")
                .merits("인생을 한발 물러서서 객관적으로 바라본다.|" +
                        "일의 인과관계를 파악하고 철저하게 이해한다.|" +
                        "사회적인 압력에 굴하지 않고 옳다고 생각하는 것을 행하는 진실성이 있다.|" +
                        "물질적인 소유나 지위에 인연하지 않는다.|" +
                        "위기 상황에 침착하게 대응한다.")
                .demerits("내가 지닌 지식과 통찰력을 세상에 드러내기까지 시간이 많이 걸린다.|" +
                        "내가 방어적이거나 다 아는 것처럼 행동하면 기분이 좋지 않다.|" +
                        "원하지 않는데도 사람들과 함께 있어야 할 때 스트레스를 받는다.|" +
                        "지식이나 기량이 부족한데도 사회적 수완이 좋아 전문 분야에서 성공한 사람들을 지켜보는 것이 힘들다.|" +
                        "내 생각을 간결하게 표현하는 것이 어렵다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은 상태일 때 5유형은 친절하고 통찰력이 있으며, 열린 마음을 가지고 있고 자족하며 상대에게 신뢰감을 준다.|" +
                        "힘든 상태일 때 5유형은 논쟁을 벌이고 상대를 잘 믿지 않으며, 관계 안에서 위축되고 부정적이 된다. 또한 상대에게 휘말려 들지 않으려고 경계를 늦추지 않는다.")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(6)
                .basicExplains("temp")
                .merits("가족과 친구들에게 충실하며 헌신적이다.|책임감을 가지고 열심히 일한다.|사람들을 연민의 눈으로 바라본다.|" +
                        "지적이며 재치가 있다.")
                .demerits("무언가를 결정할 때 끊임없이 고민한다.|" +
                        "자신감이 부족하고, 실패할까 두려워서 일을 미룬다.|" +
                        "남들에게 버려지거나 이용당할까봐 두려워한다.|" +
                        "앞으로 일어날 위험에 대해 미리 걱정하고 염려하다 지쳐버린다.|" +
                        "일을 제대로 하기 위해 일할 때 필요한 원칙을 적어놓은 책이 있으면 좋겠다고 생각한다.|" +
                        "내 기대에 부응하는 삶을 살지 못하면 심하게 자책한다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은 상태일 때 6유형은 따뜻하고 쾌활하며, 개방적이고 충직하다. 잘 지지해 주고 정직하며 공평하고 신뢰할 만하다.|" +
                        "힘든 상태일 때 6유형은 의심이 많고 지배하려 들며, 융통성이 없고 빈정댄다. 위협을 받으면 물러나거나 혹은 강력히 대항한다.")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(7)
                .basicExplains("temp")
                .merits("낙천적이여서 삶에서 부딪히는 문제들로 인한 낙담에서 빨리 벗어난다.|" +
                        "즉흥적이며 자유로운 영혼을 가지고 있다|" +
                        "거침없이 이야기하고 별나게 행동하는 것을 즐긴다.|" +
                        "관대하며, 세상을 더 나은 곳으로 만들려고 노력한다.|" +
                        "위험을 감수하며 짜릿한 모험을 거침없이 시도한다.|" +
                        "다재다능하고 관심사도 다양하다.")
                .demerits("하고 싶은 것을 다 할 수 있을 만큼의 충분한 시간이 없다.|" +
                        "한번 시작한 일을 잘 마무리하지 못한다.|" +
                        "한 우물을 파지 못하는 성격이어서 한 분야의 전문가로서의 혜택을 누리지 못한다.|" +
                        "계획한 일을 잊어버리거나 공상에 빠지는 등 비현실적인 경향이 있다.|" +
                        "일대일 관계에서 상대방에게 구속된 느낌을 받는다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은 상태일 때의 7유형은 밝고 관대하며 남을 잘 돌보고, 외향적이며 재미있다. 또한 친구와 연인에게 새로운 활동을 소개하고" +
                        " 그들의 모험의 세계로 이끈다.|힘든 상태일 때의 7유형은 자아도취적이고 자기 의견만을 고집하는 경향이 있으며, 방어적이고 산만하다. 또한 어떤" +
                        " 관계에 묶이는데 양가감정을 자주 느낀다.")
                .surroundingEvaluations("temp")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(8)
                .basicExplains("temp")
                .merits("독립적이며 자립적이다.|주도적이고 도전적인 상황에 정면으로 맞선다.|용감하고 단호하며 솔직하다.|인생을 최대한으로 즐긴다|" +
                        "가까운 사람들을 지원해주고 권한을 주며 보호해준다.|정의롭다고 생각하는 일을 지지하며 밀고 나간다.")
                .demerits("사회에서 8유형의 특성인 강함과 대담함을 '남성적인'특성으로 간주한다. 그래서 8유형의 여성들은 시회적으로 어려움을 겪는 경우가 있다.|" +
                        "의도하진 않았지만, 사람들이 나의 직설적인 면에 상처를 받거나 압도당해 피하곤 한다.|사람들의 무능함을 가만히 놔두고 볼 수가 없다.|" +
                        "위험을 무릅쓰고 도와줬는데도 고마워하지 않는 사람들을 보면 화가난다.|손해를 입거나 부당한 대접을 받은 것을 결코 잊지 못한다.|" +
                        "자신을 지나치게 압박하는 경향이 있다.|자신의 규칙을 사람들이 지키지 않거나 일이 제대로 진행되지 않으면 속이 부글부글 끓어오른다.")
                .comfortSentences("내가 신뢰하는 사람들에게 나의 부드럽고 다정한 면을 보여줘도 돼.|좋은 관계를 형성하기 위해 소소한 타협을 자주 하는 것은 가치 있는 일이야.")
                .friendWays("당신 자신과 그를 위해 맞서 대응하십시오.|강인해지고 자신감을 가지십시오. 그리고 그에게 직접적으로 이야기하면 좋습니다.|" +
                        "그에 대한 뒷이야기를 하거나 그의 신뢰를 저버리는 일은 하지마세요.|당신의 감정과 연약함을 그에게 보이세요. 그도 부드럽고 상처받기 쉬운 내면이 " +
                        "있음을 기억하세요.|그가 혼자 있을 수 있는 공간을 마련해 주십시오.|그의 공로를 인정하되 아부는 하지 마십시오.|그의 단정적인 말투를 당신에 대한" +
                        " 공격으로 여기지 마십시오.|고함을 지르거나 악담을 퍼붓고 성을 낼 때는, 그냥 그것이 그의 대처 방식일 뿐이라는 것을 기억하십시오.")
                .hardWorks("점잖은 말로 표현하기|다른 사람과 생각이 다를 때 자신의 의견을 내세우지 않기|누군가 더 잘할 수 있으리라는 생각을 하며 대표직을 내려놓기|" +
                        "운동경기에서 이기려고 최선을 다하지 않기|'괜찮아요. 당신 마음대로 하세요'라고 말하기")
                .humanRelations("좋은 상태일 때 8유형은 충직하고 남을 잘 보살펴주며, 긍정적이고 쾌활하며 솔직하다. 또한 신뢰할 만하고 헌신적이며, 관대하고" +
                        " 남을 잘 지원해준다.|힘든 상태일 때 8유형은 요구사항이 많고 오만하며, 전투적이고 소유욕이 강하다. 또한 비타협적이고 남의 약점을 빨리 찾아낸다.")
                .surroundingEvaluations("'그 사람과 함께 있으면 속에 있는 말을 솔직하게 털어놓을 수 있어요. 제가 솔직하게 이야기하지 않으면 그를 실망시킬것 같아요.'|" +
                        "'그녀는 아주 파격적이죠! 남들이 뭐라고 생각하든 상관없이 자기가 좋아하는 스타일로 옷을 입어요. 저는 그녀의 그러한 태도와 개성에 놀랍니다.'|" +
                        "'그녀는 활기차고 강력하면서도 현실적입니다. 그녀는 사람들이 선뜻 하지 못하는 말도 용기 있게 하지요. 저도 그런 그녀를 보면 속에 있는 말을 해야 할 것 같다는 생각이 들어요.|" +
                        "'그는 매우 현실적으로 회사를 경영합니다. 그는 어떻게 업무를 위임해야 하는지 알고 있으며, 상황에 민첩하게 대처하기 위해 만반의 태세를 갖추고 있습니다." +
                        " 그는 당신이 무엇을 해야 하는지 정확하게 알고 있지요. 그런점에서 보면 그는 매우 유능한 지도자라고 할 수 있습니다.'")
                .build());

        enneagramExplainRepository.save(EnneagramExplain.builder()
                .enneagramType(9)
                .basicExplains("temp")
                .merits("판단하지 않고 있는 그대로를 받아들인다.|사람들을 돌보고 그들에게 관심을 가진다.|긴장을 풀고 좋은 시간을 보낼 수 있다.|" +
                        "사람들이 나와 함께 있는 것을 편안해하며 즐거워한다.|다양한 측면에서 문제를 바라볼 수 있기 때문에 중재자나 조력자가 될 수 있다.|" +
                        "감각적이고 심미적인 안목이 발달했으며, 현실 감각이 뛰어나다.|자연스러운 흐름에 몸을 맡기며 세상과 연결된 느낌을 받을 수 있다.")
                .demerits("얌전하고 우유부단하다는 이유로 오해를 받는다.|결단력과 절제력이 부족해서 자책하게 된다.|비판에 매우 민감해서 남들이 눈살을 찌푸리거나 " +
                        "입술을 실룩거리는 것에도 일일이 신경을 쓴다.|내가 진정 원하는 것이 무엇인지 혼란스럽다.|사람들이 나를 어떻게 생각하는지에 대해 지나치게 신경을 쓴다.|" +
                        "사람들이 내 말을 잘 들어주지 않거나 진지하게 받아드리지 않는다.")
                .comfortSentences("temp")
                .friendWays("temp")
                .hardWorks("temp")
                .humanRelations("좋은상태일 때 9유형은 친절하고 부드러우며, 사람들을 지지해 주고 안심시킨다. 또한 충직하며 사람이나 상황에 대해 섣불리 판단하지 않는다.|" +
                        "힘든 상태일 때 9유형은 고집스럽고 수동적인 공격성을 보이며, 자기주장을 내세우지 않고 다른 사람이 하자는 대로 순응하며 방어적이다.")
                .surroundingEvaluations("'그녀와 함께 있으면 늘 마음이 편안해집니다. 저를 있는 그대로 받아 주는 친구거든요.'|" +
                        "'저희 부장님은 제가 아는 사람 중 가장 인내심이 많고 통찰력이 있는 분입니다. 그분이 저를 판단한다고 생각해 본 적이 없어요. 부장님의 " +
                        "그런 면 덕분에 더 열심히 일하게 되더군요.|그는 제 말을 경청한 후에 제가 미처 깨닫지 못한 진짜 문제가 무엇인지를 간파합니다.'|" +
                        "'제 친구는 자전거 여행, 래프팅, 고래 관찰, 돌고래 타기 같은 활동에 저를 데려가서 긴장하게 만듭니다. 또 겨울이 되면 우리는 환경, 평화, 새로운 과학 운동, " +
                        "인류학 등에 관한 강의를 듣습니다.'")
                .build());
    }

}